# YOLO11-S + MobileNetV3 + ECA (requires custom ultralytics copy with ECA registered)

nc: 10
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, TorchVision, [960, mobilenet_v3_large, DEFAULT, True, 2, True]]
  - [0, 1, Index, [40, 5]]
  - [0, 1, Index, [112, 12]]
  - [0, 1, Index, [960, 17]]

  - [1, 1, Conv, [256, 1, 1]]
  - [2, 1, Conv, [512, 1, 1]]
  - [3, 1, Conv, [1024, 1, 1]]

  - [4, 1, ECA, [3]]
  - [5, 1, ECA, [3]]
  - [6, 1, ECA, [5]]

head:
  - [9, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, ECA, [3]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 1, ECA, [3]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, ECA, [3]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, ECA, [5]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 20, 24], 1, Detect, [nc]]
